In [80]:
import pandas as pd

In [5]:
course_name = ['Data Science', 'Machine Learning', 'Big Data', 'Data Engineer']

duration =  [2,3,6,4]

df = pd.DataFrame(data = {'course_name' : course_name, 'duration' : duration})

In [6]:
df

        course_name  duration
0      Data Science         2
1  Machine Learning         3
2          Big Data         6
3     Data Engineer         4

In [12]:
#Q1
df.iloc[1]

course_name    Machine Learning
duration                      3
Name: 1, dtype: object

##### Q2
 the loc and iloc functions are used to access and manipulate data in a DataFrame but loc unction is label-based and is primarily used for indexing and selecting data based on labels (row and column names) while iloc function is integer-based and is used for indexing and selecting data based on integer positions.

In [14]:
#Q3
new_df = df.reindex([3,0,1,2])
new_df

        course_name  duration
3     Data Engineer         4
0      Data Science         2
1  Machine Learning         3
2          Big Data         6

In [17]:
new_df.loc[2]      # loc function returns data based on given argument index  as it is label based indexing.

course_name    Big Data
duration              6
Name: 2, dtype: object

In [18]:
new_df.iloc[2]          # iloc uses integer based indexing similar to how you would use indexing in Python lists.

course_name    Machine Learning
duration                      3
Name: 1, dtype: object

In [20]:
#Q4

import numpy as np

columns = ['column_1', 'column_2', 'column_3', 'column_4', 'column_5', 'column_6']

indices = [1,2,3,4,5,6]

#Creating a dataframe:

df1 = pd.DataFrame(np.random.rand(6,6), columns = columns, index = indices)
df1

   column_1  column_2  column_3  column_4  column_5  column_6
1  0.880616  0.925033  0.622870  0.001138  0.444881  0.934734
2  0.261671  0.562490  0.739986  0.623911  0.804352  0.486764
3  0.029340  0.982026  0.026062  0.394073  0.348730  0.313020
4  0.940821  0.156013  0.210642  0.995291  0.352880  0.229774
5  0.571697  0.537039  0.423930  0.392826  0.432464  0.482143
6  0.526038  0.555407  0.965793  0.602296  0.190929  0.786986

In [21]:
df1.mean()

column_1    0.535031
column_2    0.619668
column_3    0.498214
column_4    0.501589
column_5    0.429039
column_6    0.538904
dtype: float64

In [23]:
df1['column_2'].std()

0.3012485839378199

In [52]:
#Q5
df1['column_2'] = ['1','a','3','4','5','6']
df1

   column_1 column_2  column_3  column_4  column_5  column_6
1  0.880616        1  0.622870  0.001138  0.444881  0.934734
2  0.261671        a  0.739986  0.623911  0.804352  0.486764
3  0.029340        3  0.026062  0.394073  0.348730  0.313020
4  0.940821        4  0.210642  0.995291  0.352880  0.229774
5  0.571697        5  0.423930  0.392826  0.432464  0.482143
6  0.526038        6  0.965793  0.602296  0.190929  0.786986

In [53]:
try:
    df1['column_2'].mean()  
except TypeError:     
    print('The error will occur when attempting to calculate the mean if the replacement string cannot be converted to a numeric value.')

The error will occur when attempting to calculate the mean if the replacement string cannot be converted to a numeric value.

##### Q6
In pandas, the window functions are a powerful set of tools that allow you to perform 
calculations on a specific window or group of data points in a DataFrame or Series.

Rolling window operations

Weighted window operations

Expanding window operations

Exponentially Weighted window

In [61]:
#Q7
a =pd.Timestamp.now()
current_month = a.month
current_year = a.year
print(current_month)
print(current_year)

7
2023

In [69]:
#Q8
date1 = input("Enter the first date (YYYY-MM-DD): ")
date2 = input("Enter the second date (YYYY-MM-DD): ")

# Convert the input dates to pandas Timestamp objects
timestamp1 = pd.Timestamp(date1)
timestamp2 = pd.Timestamp(date2)

# Calculate the difference between the dates
timedelta = timestamp2 - timestamp1

# Extract the number of days, hours, and minutes from the timedelta
days = timedelta.days
hours = timedelta.seconds // 3600
minutes = (timedelta.seconds // 60) % 60

# Display the result
print("Difference between the dates:")
print(f"Days: {days}")
print(f"Hours: {hours}")
print(f"Minutes: {minutes}")

Difference between the dates:
Days: 45
Hours: 0
Minutes: 0

In [ ]:
#Q9
import pandas as pd
file_path = input("Enter the file path: ")

# Read the CSV file
df = pd.read_csv(file_path)

# Prompt the user to enter the column name
column_name = input("Enter the column name to convert: ")

# Prompt the user to enter the category order
category_order = input("Enter the category order (comma-separated): ").split(',')

# Convert the specified column to categorical data type
df[column_name] = pd.Categorical(df[column_name], categories=category_order, ordered=True)

# Sort the DataFrame based on the specified column
sorted_df = df.sort_values(by=column_name)

# Display the sorted data
print(sorted_df)

In [ ]:
#Q10
import pandas as pd
import matplotlib.pyplot as plt
file_path = input("Enter the file path: ")

# Read the CSV file
df = pd.read_csv(file_path)

# Convert the date column to datetime data type
df['Date'] = pd.to_datetime(df['Date'])

# Group the data by product category and date, and calculate the sum of sales
grouped_df = df.groupby(['Category', 'Date']).sum().reset_index()

# Pivot the data to create a pivot table
pivot_table = grouped_df.pivot(index='Date', columns='Category', values='Sales')

# Plot the stacked bar chart
pivot_table.plot(kind='bar', stacked=True)

# Set the chart title and labels
plt.title('Sales of Product Categories Over Time')
plt.xlabel('Date')
plt.ylabel('Sales')

# Display the chart
plt.show()

In [85]:
#Q11

import pandas as pd
file_path = input("enter the file path :")
df = pd.read_csv(file_path)

# calculating mean ,median ,mode of test_score column
a = df["test_score"].mean()
b = df["test_score"].median()
c = df["test_score"].mode()

# return statistical data in a table format
statistical_data = pd.DataFrame({'mean':a,
                                "median":b,
                                'mode':c})

statistical_data